// Напишите программу, которая принимает на вход координаты двух точек  
// и находит расстояние между ними 2D пространстве.

// ------------------------------Начало программы------------------------------------------------
Console.Clear();
int X1, Y1, X2, Y2;
X1 = Koords("Введите координату Х1: "); // Вызов метода с передачей параметров 
Y1 = Koords("Введите координату Y1: ");
X2 = Koords("Введите координату Х2: ");
Y2 = Koords("Введите координату Y2: ");

Console.WriteLine($"Расстояние, между точкой А({X1}, {Y1}) и точкой В({X2}, {Y2}), равно {PrintDistanceBetweenPoints(X1, Y1, X2, Y2)}");
// Вызов метода с передачей параметров по значению

// ------------------------------Конец программы------------------------------------------------

// ------------------------------Определение методов--------------------------------------------

// ---------------------------------------------------------------------------------------------
// Определяем функцию, выполняющую ввод значений координат
static int Koords(string massedg)
{
    try
    {
        Console.Write(massedg);
        int result = int.Parse(Console.ReadLine() ?? "");
        return result;
    }
    catch (Exception exc)
    {
        Console.WriteLine($"Ошибка ввода данных! {exc.Message}");
        return -1;
    }
}   

// ---------------------------------------------------------------------------------------------
// Определяем функцию, принимающую значение координаты двух точек
// и выводящую в консоль рассояник между точеками (х и у) d = √ (х А – х В) 2 + (у А – у В) 2
static double PrintDistanceBetweenPoints(int x1, int y1, int x2, int y2)
{
    double result = Math.Sqrt(Math.Pow((x2 - x1), 2) + Math.Pow((y2 - y1), 2));
    return result;
}

// ------------------------------Конец определения методов--------------------------------------------

